app/controllers/api/v1/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    if Customer.exists?(params[:id])
      render json: CustomerSerializer.new(Customer.find(params[:id]))