app/controllers/api/v1/customer_subscriptions_controller.rb

  def create
    CustomerSubscription.create(customer_id: params[:customer_id], subscription_id: params[:subscription_id])
---
INSERT INTO "customer_subscriptions" ("customer_id", "subscription_id") VALUES ($1, $2) RETURNING "id"  [["customer_id", 46], ["subscription_id", 64]]

  def destroy
    render json: CustomerSubscription.delete(params[:id])
---
DELETE FROM "customer_subscriptions" WHERE "customer_subscriptions"."id" = $1  [["id", 57]]